package emunTask;

public enum KyrgyzstanOblastar {
    BATKEN {
        @Override
        String ozgocholyktory() {
            return "Баткен облусунун озчолугу: Баткен областы Республикабыздын башка областтарынан айырмаланып өрүкзардын мекени.\n Бул өрөөндө өзүнүн татымдуулугу боюнча балдан кем эмес, асыл баалуу түркүн сорттогу өрүктөрдүн даамы менен даңазаланып келет.\n Ал гана турсун дүйнөдө сейрек кездешкен Айгул гүлү да ушул областын аймагынан орун алып келет.";
        }
    },
    OSH {
        @Override
        String ozgocholyktory() {
            return "Ош облусунун озгочолуктору: Сулайман-Тоо — Кыргызстандын, Ош шаарындагы ыйык тоо. \n 2009-жылдын июнь айында Дүйнөлүк Мурастарына кирген биринчи мамлекеттеги эстелик[1]. Сулайман тоосу Ош шаарынын так ортосунда, \nАк-Буура суусунун сол жээгинен орун алган. Узундугу – 3 км, туурасы – 1,5–2 км, деңиз деңгээлинен бийиктиги 1176 м.";
        }
    },
    CHYI {
        @Override
        String ozgocholyktory() {
            return "Чуй облусунун озгочолоугу: Бурана – Караханийлер дооруна таандык тарыхый-архитектуралык эстелик, мунара. Чүй өрөөнүндөгү Токмок шаарынан 15 км түштүк-батышта, Дөңарык айылынын чыгышында жайгашкан. Мунара Жетисуудагы түрктөргө ислам тарала баштаган мезгилде, 10-кылымдын аягы–11-кылымдын башында курулган.\n" +
                    "Бышкан кыш менен төрт бурчтуу пайдубалга сегиз кырдуу түптөлүп, цилиндр түрүндө тургузулган мунара чептин ичинде жайгашып, сырткы бети оймо-чийме менен кооздолгон, ичинде жогору карай буралып чыгуучу тепкичтер орнотулган. Бийиктиги 14 м, түбүнүн диаметри 9 м, төбөсүнүкү 6 мге жакын.";
        }
    },
    TALAS {
        @Override
        String ozgocholyktory() {
            return "Талас облусунун озгочолуктору: Манастын күмбөзү — орто кылымга (14-к.) таандык архитектуралык эстелик. Эпос жана эл ичиндеги уламыш боюнча баатырды эскерип жүрүш үчүн бейитине анын жары Каныкей атайын тургузган көрөсөндүү курулуш. \nАл ушул кезге чейин сакталган. 1893-жылда орустун белгилүү изилдөөчүсү академик В. В. Бартольддун Орто Азияга жасаган илимий саякаты жана 1895-ж.\n " +
                    "Ташкен шаарындагы археология ышкыбоздордун Түркстандык ийриминин уюштурулушу М. к-нүн илимий негизде изилденишине өбөлгө түзүлгөн. Ошол жылдары В. В. Бартольд тарабынан М. к-нүн абалы, негизги архитектуралык мүнөздөмөлөрү кагазга түшүрүлүп, ченөө иштери аткарылган.\n" +
                    " 1923-ж. Түркстандын архитектуралык эстеликтерин мамлекет тарабынан корукка алуу тууралуу атайын декрет жарыялагандан кийин М. к. Кыргыз мамлекет тарабынан коргоого алынган. Ал ким тарабынан качан, кимге арналып курулган деген көптөгөн суроолорго күмбөздүн башкы фасадындагы «куфи» жазмасындагы жазуу жооп берди. \n" +
                    "Жазуунун толук жандырмагын 1938-ж. А. М. Беленицкий сунуш кылып, кийинчерээк М. Е. \nМассон айрым өзгөртүүлөрдү кийирген: «Улуу даражалуу мазар», жакшылардын жакшысы, даанышман, сыпайы, бактылуулардын нускасы,\n" +
                    " Кудай таалага ылайык иштердин төртүнчү доордогу эгеси, аялдардын эң даңктуусу Кенизек-Хатун, урматтуу эмирдин кызы, марттык менен ырайымдын булагынын кылычы да, каламы да жеңилбес, Абуке эмирдин, алардын сырын кудаа таалам билгилик кылбасын да жүргөн жерин бейиш кылсын..";
        }
    },
    NARYN {
        @Override
        String ozgocholyktory() {
            return "Нарын облусунуну озгочолуктору: Нарындын Жаратылышы.\n" +
                    "Нарын флорасы менен фаунасынын көптүгү менен айырмаланат. Облуста сейрек кездешүүчү Тянь-Шань көк карагайы жана Түркстан арча сыяктуу өсүмдүктөр өсөт. Аймакта чычырканак, эфедра, Сент-Джон суслосу, жарроу жана Валериан сыяктуу өсүмдүктөр көп. \n" +
                    "Нарын Кара Лейлек, балабан, бүркүт, сакалчан, тоо казы, талаа бүркүтү, бүркүт, тоо архары \"Марко Поло\", Кызыл карышкыр, жейрен, аюу, сүлөөсүн, Ак илбирс сыяктуу сейрек куштардын жана жаныбарлардын жашоо чөйрөсү.";
        }
    },
    YSSYK_KOL {
        @Override
        String ozgocholyktory() {
            return "Ыссык-Кол облусунун озгочолуктору: 1. Ысык-Көл дүйнөдөгү эң терең көлдөрдүн рейтингинде жетинчи орунда турат.\n" +
                    "\n" +
                    "Кыргызстандагы эң чоң көл Ысык-Көл - дүйнөдөгү эң чоң көлдөрдүн рейтингинде 25 жана жер бетиндеги эң терең көлдөрдүн саны боюнча жетинчи орунда турат.\n" +
                    "\n" +
                    "2. Борбордук Азиядагы эң ири тоо лыжа базасы.\n" +
                    "\n" +
                    "Эң чоң тоо лыжа базасы Каракол шаарындагы Ысык-Көлдө жайгашкан. Базасы башталгыч жана тажрыйбалуу адистер үчүн иштелип чыккан.\n" +
                    "\n" +
                    "3. Көлгө 80 чакан дарыя куят, бири да агып кетпейт.\n" +
                    "\n" +
                    "Ысык-Көлгө 80 дарыя куйганына карабастан, Көлдөн бир дагы дарыя чыкпайт.";
        }
    },
    JALAL_ABAD {
        @Override
        String ozgocholyktory() {
            return "Жалал-Абыд облусунун озгочолуктору: Сары-Челек көлү-Орто Азиядагы эң кооз жана кооз бийик тоолуу көлдөрдүн бири, Чаткал кырка тоосунун (Батыш Тянь-Шань кырка тоосу) көзгө урунарлык жери.\n" +
                    " Көл Кыргыз Республикасынын батышында, Бишкектен 500 чакырым жана Оштон 300 чакырым алыстыкта, Сары-Челек коругунун аймагында, деңиз деңгээлинен 1940 метр бийиктикте жайгашкан жана түндүк-чыгыштан түштүк-батышка 7,5 кмге созулуп, 507 гектар аянтты суу менен толтурат. Сары-Челек-Орто Азиядагы үчүнчү жана Кыргызстандагы экинчи терең көл.";
        }
    };

    abstract String ozgocholyktory();
}
